package edu.inheritance;
/* 상속
* 부모클래스에 작성한 것을
* 자식 클래스에서 자식 개별의 특징으로 물려 받는 것
*
* super로 작성된 것은 반드시 메서드 내에서 제일 맨 윗 줄 작성
* 그 후에 this를 작성하거나 기능을 추가로 작성
*
* super() : 자식생성자에서 사용
*           부모에 작성한 this.변수이름 생략 후 super() 라는 명칭으로 자성
*           super()로 작성된 것은 반드시 메서드 내에서 제일 맨 윗줄 작성
*           그 후에 this를 작성하거나 기능을 추가로 작성
*
*
* super.  : 자식 메서드에서 사용
*           부모 메서드를 참조하여 기능을 확장 추가하거나 새롭게 재사용할 때 사용
*           super의 위치가 맨 위에 안와도 됨 (처음 중간 끝 상관 없음)
*           @Override : 이 기능은 부모의 클래스에 작성된 기능을 재정의한다는 알림 표시
*                       작성하지 않아도 동작하는데 문제가 되지는 않으나, 개발자간의 약속이다.
* */
public class Inheritance {
}
